--- a/source/_posts/rgw-put-obj-basic-process.md
+++ b/source/_posts/rgw-put-obj-basic-process.md
@@ -71,35 +72,46 @@ processor = store->get_atomic_writer(...);
 
 如前所述，rgw根据客户端的上传方式获取到对应的 Writer实例，然后依次调用其`prepare`->`process`->`compelete`成员函数即可完成对象上传操作。
 
-```plantuml
-@startuml
-start
-:get_xxx_writer;
-:Writer::prepare;
-:Writer::process;
-:Writer::complete;
-end
-@enduml
+```mermaid
+---
+title: RGW Put Obj 流程图
+theme: default
+---
+flowchart LR
+get_xxx_writer --> Writer::prepare --> Writer::process --> Writer::complete
+
 ```
 
 最后，来看一下rados后端这三种上传初始对应的Writer的类图。
 
